app/views/users/show.haml

%div{"data-role" => "content"}
  - @user.tasks.each do |task|
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]