app/controllers/password_reset_controller.rb

	def create
		user = User.find_by(email: params[:password_reset][:email].downcase)
		if user
			new_password = Array.new(10){[*'0'..'9', *'a'..'z', *'A'..'Z'].sample}.join
			user.update_attribute(:password, new_password)
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'mark.philosophe@gmail.com' LIMIT 1
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$Hl/UibEeMtTMcCF.CGHYwebcIIRG7L1wTcXMRGgxR35kuRtAhQDti"], ["updated_at", Sun, 04 May 2014 21:49:57 UTC +00:00]]