app/controllers/tasks_controller.rb

  def create
    @task = User.find(current_user.id).tasks.create(task_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]