app/controllers/tasks_controller.rb

  def create
    @task = current_user.tasks.create(task_params)
---
INSERT INTO "tasks" ("created_at", "name", "priority", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 08 Apr 2014 18:13:13 UTC +00:00], ["name", "Task 1"], ["priority", 1], ["updated_at", Tue, 08 Apr 2014 18:13:13 UTC +00:00], ["user_id", 1]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "priority" = ?, "updated_at" = ? WHERE "tasks"."id" = 2  [["priority", 2], ["updated_at", Sat, 05 Apr 2014 18:35:44 UTC +00:00]]

  def clear
    @tasks = Task.where('user_id = ? AND complete = ?', current_user.id, true)
    @tasks.destroy_all
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]

  def complete
    @task.update(complete: true)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["complete", true], ["updated_at", Tue, 15 Apr 2014 00:21:02 UTC +00:00]]

  def restore
    @task.update(complete: false)
---
UPDATE "tasks" SET "complete" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["complete", false], ["updated_at", Wed, 16 Apr 2014 21:00:20 UTC +00:00]]

  def destroy
    @task.user.options.create(value: @task.priority)
    @task.destroy
---
INSERT INTO "options" ("created_at", "updated_at", "user_id", "value") VALUES (?, ?, ?, ?)  [["created_at", Sat, 26 Apr 2014 19:00:47 UTC +00:00], ["updated_at", Sat, 26 Apr 2014 19:00:47 UTC +00:00], ["user_id", 1], ["value", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 1]]