app/controllers/to_dos_controller.rb

SELECT "to_dos".* FROM "to_dos"
---
  def index
    @to_dos = ToDo.all

INSERT INTO "to_dos" ("created_at", "name", "priority", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 03 Apr 2014 18:39:01 UTC +00:00], ["name", "Take Out the Trash"], ["priority", 2], ["updated_at", Thu, 03 Apr 2014 18:39:01 UTC +00:00]]
---
  def create
    @to_do = ToDo.new(to_do_params)

    respond_to do |format|
      if @to_do.save

UPDATE "to_dos" SET "name" = ?, "priority" = ?, "updated_at" = ? WHERE "to_dos"."id" = 2  [["name", "Blah blah blahlkl"], ["priority", 1], ["updated_at", Sat, 05 Apr 2014 03:19:28 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @to_do.update(to_do_params)

DELETE FROM "to_dos" WHERE "to_dos"."id" = ?  [["id", 1]]
---
  def destroy
    @to_do.destroy

SELECT "to_dos".* FROM "to_dos" WHERE "to_dos"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_to_do
      @to_do = ToDo.find(params[:id])