app/controllers/users_controller.rb

  def show
    @user = User.includes(:tasks).find(current_user.id)
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user = User.create(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password_digest", "remember_token", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "users" SET "remember_token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["remember_token", "0245dc7ca19045945289bc1eb0ea24b3bf8c1f65"], ["updated_at", Tue, 08 Apr 2014 17:58:43 UTC +00:00]]

  def update
    @user = current_user

    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "email" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "mark-a-brown@live.com"], ["password_digest", "$2a$10$1Z3Rci6d0OCVAPQVNjD5QuEZMccX0KeFDcOg5pgdb9TvMJnemSSIm"], ["updated_at", Wed, 30 Apr 2014 22:43:36 UTC +00:00]]